<template>
	<view class="content">
		<div class="buttonG">
			<u-button type="primary" plain shape="circle" @click="changeSkuShow">选择规格</u-button>
		</div>





		<!-- 选择规格的弹窗 -->
		<c-sku ref="selectSku" :specGroups="specGroups" :skus="skus" ></c-sku>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				specGroups: [{
						"name": "颜色分类",
						"spec_items": [{
								"id": "1739223143940151",
								"name": "5色混发"
							},
							{
								"id": "1739223143941127",
								"name": "蓝色"
							},
							{
								"id": "1739223143941143",
								"name": "粉色"
							},
							{
								"id": "1739223143941159",
								"name": "紫色"
							},
							{
								"id": "1739223143941175",
								"name": "绿色"
							},
							{
								"id": "1739223143942151",
								"name": "黄色"
							}
						]
					},
					{
						"name": "规格",
						"spec_items": [{
								"id": "1739223143942183",
								"name": "100只"
							},
							{
								"id": "1739223143942199",
								"name": "200只"
							}
						]
					},
					{
						"name": "款式",
						"spec_items": [{
								"id": "1739223146718301",
								"name": "成人"
							},
							{
								"id": "1739223146718317",
								"name": "儿童"
							},
							{
								"id": "1739223146718333",
								"name": "亲子款（成人+儿童）"
							}
						]
					}

				],

				skus: {
					"1739223143940151;1739223143942183;1739223146718301": {
						"stock_num": 0,
						"effective_price": "12.90",
						"info": "颜色分类:5色混发规格:100只款式:成人"
					},
					"1739223143940151;1739223143942183;1739223146718317": {
						"stock_num": 94550,
						"effective_price": "12.90",
						"info": "颜色分类:5色混发规格:100只款式:儿童"
					},
					"1739223143940151;1739223143942183;1739223146718333": {
						"stock_num": 90920,
						"effective_price": "12.90",
						"info": "颜色分类:5色混发规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143940151;1739223143942199;1739223146718301": {
						"stock_num": 89973,
						"effective_price": "20.90",
						"info": "颜色分类:5色混发规格:200只款式:成人"
					},
					"1739223143940151;1739223143942199;1739223146718317": {
						"stock_num": 97544,
						"effective_price": "21.90",
						"info": "颜色分类:5色混发规格:200只款式:儿童"
					},
					"1739223143940151;1739223143942199;1739223146718333": {
						"stock_num": 95356,
						"effective_price": "21.90",
						"info": "颜色分类:5色混发规格:200只款式:亲子款（成人+儿童）"
					},
					"1739223143941127;1739223143942183;1739223146718301": {
						"stock_num": 0,
						"effective_price": "9.90",
						"info": "颜色分类:蓝色规格:100只款式:成人"
					},
					"1739223143941127;1739223143942183;1739223146718317": {
						"stock_num": 98126,
						"effective_price": "12.90",
						"info": "颜色分类:蓝色规格:100只款式:儿童"
					},
					"1739223143941127;1739223143942183;1739223146718333": {
						"stock_num": 98248,
						"effective_price": "11.90",
						"info": "颜色分类:蓝色规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143941127;1739223143942199;1739223146718301": {
						"stock_num": 96546,
						"effective_price": "18.90",
						"info": "颜色分类:蓝色规格:200只款式:成人"
					},
					"1739223143941127;1739223143942199;1739223146718317": {
						"stock_num": 98740,
						"effective_price": "21.90",
						"info": "颜色分类:蓝色规格:200只款式:儿童"
					},
					"1739223143941127;1739223143942199;1739223146718333": {
						"stock_num": 98644,
						"effective_price": "20.90",
						"info": "颜色分类:蓝色规格:200只款式:亲子款（成人+儿童）"
					},
					"1739223143941143;1739223143942183;1739223146718301": {
						"stock_num": 96154,
						"effective_price": "9.90",
						"info": "颜色分类:粉色规格:100只款式:成人"
					},
					"1739223143941143;1739223143942183;1739223146718317": {
						"stock_num": 98795,
						"effective_price": "12.90",
						"info": "颜色分类:粉色规格:100只款式:儿童"
					},
					"1739223143941143;1739223143942183;1739223146718333": {
						"stock_num": 98837,
						"effective_price": "11.90",
						"info": "颜色分类:粉色规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143941143;1739223143942199;1739223146718301": {
						"stock_num": 0,
						"effective_price": "18.90",
						"info": "颜色分类:粉色规格:200只款式:成人"
					},
					"1739223143941143;1739223143942199;1739223146718317": {
						"stock_num": 98947,
						"effective_price": "21.90",
						"info": "颜色分类:粉色规格:200只款式:儿童"
					},
					"1739223143941143;1739223143942199;1739223146718333": {
						"stock_num": 98941,
						"effective_price": "20.90",
						"info": "颜色分类:粉色规格:200只款式:亲子款（成人+儿童）"
					},
					"1739223143941159;1739223143942183;1739223146718301": {
						"stock_num": 96297,
						"effective_price": "9.90",
						"info": "颜色分类:紫色规格:100只款式:成人"
					},
					"1739223143941159;1739223143942183;1739223146718317": {
						"stock_num": 98851,
						"effective_price": "12.90",
						"info": "颜色分类:紫色规格:100只款式:儿童"
					},
					"1739223143941159;1739223143942183;1739223146718333": {
						"stock_num": 98842,
						"effective_price": "11.90",
						"info": "颜色分类:紫色规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143941159;1739223143942199;1739223146718301": {
						"stock_num": 98731,
						"effective_price": "18.90",
						"info": "颜色分类:紫色规格:200只款式:成人"
					},
					"1739223143941159;1739223143942199;1739223146718317": {
						"stock_num": 98969,
						"effective_price": "21.90",
						"info": "颜色分类:紫色规格:200只款式:儿童"
					},
					"1739223143941159;1739223143942199;1739223146718333": {
						"stock_num": 98937,
						"effective_price": "20.90",
						"info": "颜色分类:紫色规格:200只款式:亲子款（成人+儿童）"
					},
					"1739223143941175;1739223143942183;1739223146718301": {
						"stock_num": 96678,
						"effective_price": "9.90",
						"info": "颜色分类:绿色规格:100只款式:成人"
					},
					"1739223143941175;1739223143942183;1739223146718317": {
						"stock_num": 98819,
						"effective_price": "12.90",
						"info": "颜色分类:绿色规格:100只款式:儿童"
					},
					"1739223143941175;1739223143942183;1739223146718333": {
						"stock_num": 98869,
						"effective_price": "11.90",
						"info": "颜色分类:绿色规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143941175;1739223143942199;1739223146718301": {
						"stock_num": 98711,
						"effective_price": "18.90",
						"info": "颜色分类:绿色规格:200只款式:成人"
					},
					"1739223143941175;1739223143942199;1739223146718317": {
						"stock_num": 98938,
						"effective_price": "21.90",
						"info": "颜色分类:绿色规格:200只款式:儿童"
					},
					"1739223143941175;1739223143942199;1739223146718333": {
						"stock_num": 98954,
						"effective_price": "20.90",
						"info": "颜色分类:绿色规格:200只款式:亲子款（成人+儿童）"
					},
					"1739223143942151;1739223143942183;1739223146718301": {
						"stock_num": 98050,
						"effective_price": "9.90",
						"info": "颜色分类:黄色规格:100只款式:成人"
					},
					"1739223143942151;1739223143942183;1739223146718317": {
						"stock_num": 98949,
						"effective_price": "12.90",
						"info": "颜色分类:黄色规格:100只款式:儿童"
					},
					"1739223143942151;1739223143942183;1739223146718333": {
						"stock_num": 98932,
						"effective_price": "11.90",
						"info": "颜色分类:黄色规格:100只款式:亲子款（成人+儿童）"
					},
					"1739223143942151;1739223143942199;1739223146718301": {
						"stock_num": 98918,
						"effective_price": "18.90",
						"info": "颜色分类:黄色规格:200只款式:成人"
					},
					"1739223143942151;1739223143942199;1739223146718317": {
						"stock_num": 98986,
						"effective_price": "21.90",
						"info": "颜色分类:黄色规格:200只款式:儿童"
					},
					"1739223143942151;1739223143942199;1739223146718333": {
						"stock_num": 98977,
						"effective_price": "20.90",
						"info": "颜色分类:黄色规格:200只款式:亲子款（成人+儿童）"
					}
				}

			}
		},
		onLoad() {

		},
		methods: {
			changeSkuShow() {
				let id = "1739223143940151;1739223143942199;1739223146718333"
				this.$refs.selectSku.changeShow(id)
			}
		}
	}
</script>

<style lang="scss">
	.buttonG {
		padding: 30rpx;
	}
</style>
